khttang/esp32-biometric-system/firmware/sdkconfig.defaults
# =============================================================================
# 1. Core Operating System & Task Stacks
# =============================================================================
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096
CONFIG_FREERTOS_IDLE_TASK_STACKSIZE=4096
CONFIG_PTHREAD_TASK_STACK_SIZE_DEFAULT=4096

# Extended Watchdog Timeout for DSI / Camera Bring-up
CONFIG_ESP_TASK_WDT_TIMEOUT_S=15

# =============================================================================
# 2. ESP32-P4 Target Directives
# =============================================================================
CONFIG_IDF_TARGET="esp32p4"
CONFIG_IDF_TARGET_ESP32P4=y

# =============================================================================
# 3. External RAM (PSRAM) Configuration (32MB @ 200MHz)
# =============================================================================
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768

# =============================================================================
# 4. Flash & Partition Table Configuration (16MB)
# =============================================================================
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"
CONFIG_PARTITION_TABLE_OFFSET=0xc000

# =============================================================================
# 5. Processor L2 Cache Boost (ESP-DL Neural Engine Acceleration)
# =============================================================================
CONFIG_CACHE_L2_CACHE_128KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y

# =============================================================================
# 6. Peripheral Drivers & Compiler Features
# =============================================================================
CONFIG_COMPILER_CXX_EXCEPTIONS=y
CONFIG_COMPILER_CXX_EXCEPTIONS_EMG_BUFF_SIZE=256
CONFIG_COMPILER_CXX_RTTI=y

# ESP-DL Neural Engine Support
CONFIG_ESP_DL_MULTICORE=y
CONFIG_ESP_DL_SUPPORT=y
CONFIG_ESP_WHO_SUPPORT=y

# Camera Controller, ISP & PPA Acceleration
CONFIG_ESP_DRIVER_CAM_CSI_ENABLE=y
CONFIG_ESP_DRIVER_ISP_ENABLE=y
CONFIG_PPA_ENABLE=y

# RMII EMAC Ethernet Driver
CONFIG_ETH_ENABLED=y
CONFIG_ETH_USE_ESP32P4_EMAC=y
CONFIG_ETH_PHY_INTERFACE_RMII=y
CONFIG_ETH_RMII_CLK_INPUT=y

# Power Management
CONFIG_PM_ENABLE=y
CONFIG_PM_DFS_INIT_AUTO=n
CONFIG_PM_PROFILING=n

# =============================================================================
# 7. MIPI-DSI, LVGL 9 & esp_lvgl_port Directives
# =============================================================================
CONFIG_LCD_ENABLE_MIPI_DSI_PANEL=y

# LVGL 9 Configuration
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_USE_PPA=y
CONFIG_LV_DRAW_BUF_ALIGN=128

# esp_lvgl_port Task Settings
CONFIG_ESP_LVGL_PORT_TASK_STACK_SIZE=8192
CONFIG_ESP_LVGL_PORT_TASK_AFFINITY_CPU0=y

# OV5647 Camera Sensor Settings
CONFIG_CAMERA_OV5647=y
CONFIG_CAMERA_OV5647_AUTO_DETECT_MIPI_INTERFACE_SENSOR=y
CONFIG_CAMERA_OV5647_MIPI_RAW10_1280X960_BINNING_45FPS=y
CONFIG_CAMERA_OV5647_DEFAULT_IPA_JSON_CONFIGURATION_FILE=y
CONFIG_CAMERA_OV5647_MIPI_DEFAULT_FMT_RAW10_1280X960_BINNING_45FPS=y

# Biometrics Wrapper Custom Kconfig
CONFIG_BIOMETRICS_CAM_WIDTH=1280
CONFIG_BIOMETRICS_CAM_HEIGHT=960
CONFIG_BIOMETRICS_ENABLE_FACE_DETECTION=y

CONFIG_ESP_LCD_HX8394_SKIP_I2C_INIT=y